{
  "no": {
      "TCheckbuttonDisplay_txt": "Vis spelereglar",
      "TLabel5_txt": "Registrer spelarane her:",
      "TLabel1_txt": "spelar 1",
      "TLabel2_txt": "spelar 2",
      "TLabel3_txt": "spelar 3",
      "TLabel4_txt": "spelar 4",
      "TButtonDismiss_txt": "Lukk",
      "TBtnNext_txt": "Neste",
      "TBtnGoOn_txt": "Start",
      "guidance_txt": "Kva kort vil du snu?",
      "u_text" : {
            "1": "potetåker i blomst",
            "2": "Vedstabelen rasa saman. Den hadde krympa under tørking.\nDifor er stablar av favneved kun er ein meter høge.",
            "3": " 'Skogbrann' stod å lese i lokalavisa. Born i nabolaget hadde leika ved\neit bål. Dette resulterte i at 35 mål skog vart øydelagd.",
            "4": "Felling av store tre med motorsag. Tre som veks seg store står i fare\nfor å ramle over ende i storm. Særleg ved hus kan dei gjere skade.",
            "5": "Mykje greiner å ryddja etter trefelling. Tjukke greiner blir til\nved, medan det andre blir sanka saman og brent på bål.",
            "6": "Bonden fører tilsyn med eigedommen sin. Beitevandring er ofte nytta.\nHer er det biltur til Vabakkjen ved Sørakjødno.",
            "7": "Storavatnet er omlag 6 km langt. Det er eit fiskerikt vassdrag og\ndet fylgjer fiskerettar med garden.",
            "8": "Her er det lasta opp ei trestamme som skal til sagbruk\nfor å bli til plank.",
            "9": "Liarbønaustet er eit gamalt naust bygd av stein.\nHer ved Storavatnet hadde dei fått løyve til å ha båten sin.",
            "10": "Avkjøyrsle mot skogen. Her vart det i gamal tid flytta buskap mot\nTislavollsetera, og henta ved og tømmer.",
            "11": "Menzi muck 3000EH er ein gravemaskin frå -70 talet. Den er hendig\ntil grøftevedlikehald, opplasting og løfting.",
            "12": "Når bonden har fôra dyra er det viktig å vera i sammen med dei for\nå følgja med. Har dyra det bra, er alle kome inn, eller er nokon sjuke.",
            "13": "Lamminga er den travlaste tida. Mange sauer må ha hjelp, men når\nlamma finn mat hjå mor går det oftast bra.",
            "14": "Tvillingar, er lykka for sau og bonde. Her er to trivelege lam.\nTru om dei har det bra?",
            "15": "Gamle løa er reparet monge gongar. Ho er vorte så dårleg at\ndet er tid for riving.",
            "16": "Potetopptak er innhausting av poteteavling. Her er potetene\nkomme i eigne luftige potetkassar, klar for lagring.",
            "17": "Oselvaren er lagra i naustet ved Storavatnet. Det er tre bord i\nein Oselvar. Dette er gamal båtbyggjar kunst, eldre en vikingtida.",
            "18": "Traktoren er nyttig til transport av greiner som skal\ntil bålplassen etter trefelling.",
            "19": "Traktor; Same Falcon 4wd 50 hk m/laster, kjøpt på Osterøy.",
            "20": "Gardsbil; Mitsubish L200 pickup, kjøpt hos Fylkesnes Bil as på Stord.",
            "21": "Gardsveiane er livsnerva, her vert menneska, dyr, fôr,\nog trevirke frakta. Det er viktig å vedlikehalda desse.",
            "22": "'Silopress', når graset er hausta inn til siloen, må denne bli lufttett.\nDette blir gjort med plast og lodd mot siloveggen.",
            "23": "Hagestell er trivseltiltak.\nHer vert det planta i blomar i eit bed ved våningshusert.",
            "24": "Sauehuset ligg på ein haug nær tunet. I bakgrunnen ser ein fjellbeitet.\nRundt er det vedskog, beite og slotteeng.",
            "25": "Ranveigstova frå ca.1740 vart flytta hit frå hovud tunet på garden då\nden vart delt mellom to brødre i 1850 og er ein del av huset.",
            "26": "Frittgåande høner har det godt her. Hanen har tidlegare\nlevd med ein vær, men er no lykkelig saman med nokre høner.",
            "27": "Vabakkjen er 18 mål fuldyrka jord. Her er ein god stad for\nhjortejakt. Til høgre ligg ein bekk som ein vada over i gamal tid.",
            "28": "Midttjødo ligg nordom Vahaugen. Bakkjen til høgre her er\nein del av Vabakkjen som vart dyrka på 1990 talet",
            "29": "Nausthaugen ligg nordom naustbakkjen der me\nfeirar st.Hans.",
            "30": "st.Hansbål er avsluttninga på feiringa kvart år,\nfor ca. 20 personer.",
            "31": "Ospetre i haustskrud. Dessverre vart klyngja kvesta av\nein storm. Tre trær velta den gongen.",
            "32": "Hesjing er når ein haustar gras som vert hengt opp til tørk\npå strengjer som her. Det blir godt høy om det vert tort.",
            "33": "Graset spirer og gror. Når det er modent kan det haustast til\nfôr for husdyr.",
            "34": "Driftsbygning med to siloar for 50 vinterfôra sauer.\nHer er strekkmetallgulv og siloheis med klype.",
            "35": "Utmarksbeite ved Edlensneset.",
            "36": "Kalvabeite mot nordaust."
                    },
      "about_txt" : "\n                                                                  I N F O :\n\n                                    Minnespel_smaabruk,  versjon  0.5.2\n                            Copyright © 2023, 2024 av Halvard.A. Tislavoll\n                          Denne kildekode er fri til bruk under MIT Lisens\n\nEg er sjølv fotograf for alle bilder brukt i dette programmet.  Dei er inspirert\nav eiga sauedrift på slektsgarden vår, her på Tislavoll bruk 4, i Fitjar kommune.\n\nProgrammet er eit resultat av eiga programerings-erfaring og eigen tankekraft.\nEg har nytta Linuxmint 21 Cinnamon som operativsystem, og skrive skriptet i \nPython ver.: 3.10.12 syntaks. Det grafiske grensesnittet GUI er utforma ved hjelp\nav PAGE ver.: 8.0. (Python Automated GUI generator ved Donald Rozenberg)\nUtviklinga av programmet har gått føre seg i eit lettvekter IDE kalla Geany ver.1.38\nTakkar spesielt G.D.Walters for lærerike artikler i FCM og anna coaching.\n\nhttps://github.com/HalvardTislavoll/minnespel_smaabruk",
      "instruction_txt" : "\n                                                    S P E L E R E G L A R :\n\nMinnespelet småbruk handlar om å finna like bileter frå temaet småbruk.\nPå sida her til venstre er spelaren sitt spelebrett med ni spelekort bileter.\nI byrjinga syner spelekorta ei ugle, det er baksida av spelekortet.\nSpelekorta kan snuast ved hjelp av klikk med musa, eit om gongen.\nKortet øverst til venstre her, held på å bli snudd. Derfor skiftar ugla\nplass med biletet på kortet. Er biletet likt med det store biletet som er til høgre?\nDersom bileta er like, blir ikke spelekortet snudd tilbake. Det store \nbiletet blir også bytta ut mot eit nytt. \nUgla gøymer ikkje lenger biletet, men er dei ikkje like vil \nbiletet bli gøymt etter kort tid. Klarer du å finna like kort får du og\nnytt forsøk før neste spelar overtar spelinga med sin farge.\nEr du dyktig til å hugse kva for bilete du har snudd?\nFørste spelar som har snudd alle korta sine har vunnet spelet.\n\n                                                                                                        Til lukka med spelinga!"          },
  "en": {
      "TCheckbuttonDisplay_txt": "Show instructions",
      "TLabel5_txt": "Player Registration",
      "TLabel1_txt": "player 1",
      "TLabel2_txt": "player 2",
      "TLabel3_txt": "player 3",
      "TLabel4_txt": "player 4",
      "TButtonDismiss_txt": "Dismiss",
      "TBtnNext_txt": "Next",
      "TBtnGoOn_txt": "Go On",
      "guidance_txt": "What card do you want to turn over?",
      "u_text" : 
                {
            "1": "Potato field in flower.",
            "2": "The woodpile collapsed. It had shrunk during drying. \nThis is why the poles made of fawnwood are only one meter high.",
            "3": "'Forest fire' was read in the local newspaper. Children in the \nneighborhood had been playing by a fire. This resulted in 35 acres of forest being destroyed.",
            "4": "Felling large trees with a chainsaw. Trees that grow large are in danger \nof falling over in storms. They can cause damage, especially around houses.",
            "5": "Lots of branches to clear after tree felling. Thick branches become \nfirewood, while the rest are gathered together and burned on a fire.",
            "6": "Bonden fører tilsyn med eigedommen sin. Beitevandring er ofte nytta.\nHer er det biltur til Vabakkjen ved Sørakjødno.",
            "7": "'Storavatnet' is approximately 6 km long. It is a lake rich \nin fish, and fishing rights come with the farm.",
            "8": "Here, a tree trunk has been uploaded that is to be sawn\nto be turned into materials.",
            "9": "'Liarbønaustet' is an old boathouse built of stone \nhere by Storavatnet they previously had a license to keep their boat.",
            "10": "Exit towards the forest. Here, in olden times, cattle were moved towards\nTislavollsetera (seter is a summer barn), and firewood and timber were fetched.",
            "11": "'Menzi muck 3000EH' is an excavator from the 1970s. It is handy\nfor ditch maintenance, loading and lifting.",
            "12": "When the farmer has fed the animals, it is important to be with them for\now follow along. Are the animals well, have they all come in, or is anyone sick.",
            "13": "Lambing is the busiest time. Many sheep need help, but when the lambs \nfind food from their mother, it usually goes well.",
            "14": "Twins are lucky for sheep and farmers. Here are two happy lambs.\nDo you think they are doing well?",
            "15": "The old barn has been repaired many times. It's gone so bad that \nit's time for demolition.",
            "16": "Potato harvesting is the harvesting of the potato crop. Here the potatoes \ncome in their own airy potato crates, ready for storage.",
            "17": "The 'Oselvar' is stored in the boathouse at Storavatnet. There are three tables in \nthe Oselvar. This is an old art of boat building, older than the Viking Age.",
            "18": "Nowadays, the tractor is useful for transporting branches to \nthe bonfire after felling.",
            "19": "The tractor; Same Falcon 4wd 50 hp w/loader, bought on Osterøy.",
            "20": "The garden car; Mitsubishi L200 pickup, bought from Fylkesnes Bil as in Stord.",
            "21": "The farm roads are the lifeblood, here people, animals, fodder and \nwood are transported. It is important to maintain these.",
            "22": "'Silopress', when the grass has been harvested into the silo, it must be airtight.\nThis is done with plastic and plumb bob against the silo wall.",
            "23": "Gardening is a well-being measure.\nHere there are plants in flowers in a bed by the farmhouse.",
            "24": "The sheep house is on a mound near the yard. In the background you can see the mountain pasture.\nAll around there are woodlands, pastures and castle meadows.",
            "25": "'Ranveigstova' from 1740 is a timber living room that was moved here from the main yard \non the farm when it was divided in 1850 and is part of the house.",
            "26": "Free-range hens do well here. The rooster has previously \nlived with a ram, but is now happy together with some hens.",
            "27": "'Vabakkjen' is 18 acres of fully cultivated land. Here is a good place for \ndeer hunting. To the right is a stream that you used to wade across in olden times.",
            "28": "'Midttjødo' ligg nordom Vahaugen. Bakkjen til høgre her er\nein del av Vabakkjen som vart dyrka på 1990 talet",
            "29": "'Nausthaugen' is located north of the naust ground where St. Hans is celebrated.",
            "30": "'st.Hans'' bonfire is the end of the midsummer celebration every year, \nfor approx. 20 people.",
            "31": "Tree aspen in fall foliage. Unfortunately, three clusters were damaged \nby a storm. Tree trees fell that time.",
            "32": "A hayrack is when you harvest grass that is hung up to dry \non strings like here. It will be good hay if it gets dry.",
            "33": "The grass sprouts and grows. When it is ripe, it can be harvested for feed for livestock.",
            "34": "Operating building with two silos for 50 winter-fed sheep. \nThere is a stretch metal floor and a silo lift with clamp.",
            "35": "Open field pasture at 'Edlensneset' (torv=peat and myr=bog).",
            "36": "'Kalvebeite' Calf grazing to the northeast"
                    },
      "about_txt" : "\n                                                               A B O U T :\n\n                    The Farm Memory game; minnespel_smaabruk, version 0.5.2\n                             Copyright © 2023, 2024 by Halvard.A. Tislavol\n                          This source code is free to use under the MIT License\n\nI myself am the photographer for all images used in this program. They are \ninspired of our own sheep farm on our family farm, here at Tislavoll bruk 4,\nin Fitjar municipality.\nThe program is a result of own programming experience and own thinking power.\nI have used Linuxmint 21 Cinnamon as the operating system, and write the script\nin it Python ver.: 3.10.12 syntax. The graphical interface GUI is designed using\nof PAGE ver.: 8.0. (Python Automated GUI generator) Thanks to Donald \nRozenberg. And the The development of this program has taken place in a \nlightweight IDE called Geany ver. 1.38\nSpecial thanks to G.D. Walters for instructive articles in FCM and other coaching.\n\nhttps://github.com/HalvardTislavoll/minnespel_smaabruk",
      "instruction_txt" : "\n                                                    I N S T R U C T I O N S :\n\nA Farm Memory game is about finding similar pictures from the topic \nof small farms. On the page to the left is the player's playing board with \nnine playing card images. At the beginning, the playing card shows an owl,\nthat is the back of the playing card. Playing cards can be turned over by \nclicking with the mouse, one at a time. The card at the top left here,\nabout to be turned over. Therefore, the owl changes space\nwith the image on \nthe card. Is the image similar to the large image on the right?\nIf the images are the same, the playing card is not turned over.\nThe big image is also replaced with a new one. The owl no longer hides \nthe picture, but if they are not the\nsame, the image will be hidden after a \nshort time. If you manage to find similar cards, you get and another \nattempt before the next player takes over the game with his suit. \nAre you good at figuring out what kind of picture you have flipped? \nThe first player to turn over all their cards has won the game.\n\n                                                                                                                      Good luck!"
          }
}
